-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--

-- Generation Time: Jul 28, 2023 at 03:02 PM
-- Server version: 8.0.33-0ubuntu0.22.04.2
-- PHP Version: 8.2.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `freedb_membersdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `members`
--

CREATE TABLE `members` (
  `name` varchar(150) NOT NULL,
  `indexnum` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `idnum` int NOT NULL,
  `birth` varchar(10) NOT NULL,
  `phone` int NOT NULL,
  `addr` varchar(200) NOT NULL,
  `id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `members`
--

INSERT INTO `members` (`name`, `indexnum`, `idnum`, `birth`, `phone`, `addr`, `id`) VALUES
('H.L නිමල් මුණසි‍‍ංහ', '01', 12345, '12345', 12345678, 'ගලබඩ', 1),
('W.A ජයන්ත වීරසිංහ', '02', 12345, '12345', 774086139, 'ගලබඩ', 2),
('M.D.වීරරත්න', '03', 12345, '12345', 719491864, 'ගලබඩ', 3),
('G.D සෙනරත් හේමචන්ද්‍ර ', '04', 12345, '12345', 715646835, 'ගලබඩ', 4),
('ඉසංක අනුරාධ', '05', 12345, '12345', 1234567, 'ගලබඩ', 11),
('G.D ‍‍‍ ශෂික  රමේෂ්  ගොඩහේන', '06', 12345, '12345', 715699525, 'ගලබඩ', 12),
('P.k රත්නසිරි විජේසූරිය ', '07', 12345, '12345', 717331710, 'මීගස්තැන්න', 13),
('R.A නිහාල්  කුලරත්න', '08', 12345, '12345', 776626263, 'මීගස්තැන්න', 14),
('සුදත් චාමර', '09', 12345, '12345', 12345678, 'ගලබඩ', 15),
('චමින්ද සමන්කුමාර', '10', 12345, '12345', 779121913, 'මීගස්තැන්න', 16),
('ස‍ංජීව රන්කොත්දිවෙල', '11', 12345, '12345', 12345678, 'මීගස්තැන්න', 17),
('දමිත්  ඉන්ද්‍රජිත් ', '12', 12345, '12345', 719283636, 'මීගස්තැන්න', 18),
('ඉෂාන් චමින්ද ', '13', 12345, '12345', 707382555, 'ගලබඩ', 19),
('සෙනරත් ජයකොඩි', '14', 12345, '12345', 714665263, 'පිල්ලෑව', 20),
('E.සුනිල් කුමාර', '15', 12345, '12345', 776304785, 'මීගස්තැන්න', 21),
('කැලුම් තුෂාර', '16', 12345, '12345', 12345778, 'සිරිපාගම', 22),
('G.L තිලිනිතා මදුෂානි', '17', 12345, '12345', 12345678, 'මීගස්තැන්න', 23),
('U.වීනීතා රංජනී', '18', 12345, '12345', 12345678, 'මීගස්තැන්න', 24),
('A.A නිල්මිනි චන්ද්‍රලතා', '19', 12345, '12345', 12345678, 'ගලබඩ', 25),
('U.L චන්ද්‍රා ලියනගේ', '20', 12345, '12345', 12345678, 'ගලබඩ', 26),
('G.D අයිරා‍ංගනී ශීයාලතා', '21', 12345, '12345', 12345678, 'ගලබඩ', 27),
('W.M චාමර ලක්මාල්', '22', 12345, '12345', 12345678, 'ගලබඩ', 29),
('R.P චමින්ද බුද්ධික', '23', 12345, '12345', 12345678, 'මීගස්තැන්න', 30),
('උපාලි සෙනෙවිරත්න', '24', 12345, '12345', 12345678, 'මීගස්තැන්න', 31),
('B.A ලක්ෂිත සදරුවන් ', '25', 12345, '12345', 12345678, 'පිල්ලෑව', 32),
('P. සුජීව  කුමාරවංශ', '26', 12345, '12345', 12345678, 'මීගස්තැන්න', 33),
('R.D යොහාන් ව්මලරත්න', '27', 12345, '12345', 12345678, 'මීගස්තැන්න', 34),
('U. සුනිල් ශාන්ත ', '28', 12345, '12345', 12345678, 'මීගස්තැන්න', 35),
('නිරෝෂා කරුනාරත්න', '29', 12345, '12345', 12345678, 'ගලබඩ', 36),
('දිනෙෂ් චන්ද්‍රසේන ', '30', 12345, '12345', 12345678, 'පිල්ලෑව', 37),
('H.L ඉන්ද්‍රානි  චාන්දනී  ', '31', 12345, '12345', 12345678, 'ගලබඩ', 39),
('A.D ජෝර්ජ් ගාමිනී', '32', 12345, '12345', 12345678, 'ගලබඩ', 40),
('R.D වීරරත්න ', '33', 12345, '12345', 12345678, 'මීගස්තැන්න', 41),
('උපුල් චමින්ද ', '34', 12345, '12345', 12345678, 'ආදැල්ල', 42),
('ජයනි නිසන්සලා', '35', 12345, '12345', 12345678, 'ගලබඩ', 43),
('අස‍ංක', '36', 12345, '12345', 12345678, 'මීගස්තැන්න', 44),
('H. ලක්ෂාන් කල්හාර හේමචන්ද්‍ර ', '37', 12345, '12345', 12345678, 'මීගස්තැන්න', 45),
('R.P නීල් බන්ධනායක', '38', 12345, '12345', 12345678, 'මීගස්තැන්න', 46),
('K.A ආනන්ද සමරවීර ', '39', 12345, '12345', 12345678, 'මීගස්තැන්න', 47),
('G.D දයානන්දනී', '40', 12345, '12345', 12345678, 'ගලබඩ', 48),
('L.A ප්‍රදීප් සංජීව ලියනාරච්චි ', '41', 12345, '12345', 12345678, 'ගලබඩ', 49),
('L.A ප්‍රදීප් සංජීව ලියනාරච්චි ', '42', 12345, '12345', 12345678, 'ගලබඩ', 50),
('S.M ප්‍රියංකා  ධර්මසිරි ', '43', 12345, '12345', 12345678, 'ආදැල්ල', 51),
('H.L වික්‍රමසිංහ ', '44', 12345, '12345', 12345678, 'ආදැල්ල', 52),
('P.H නිලංග සමන්කුමාර', '45', 12345, '12345', 12345678, 'මීගස්තැන්න', 53),
('S.M කමල් ප්‍රසංග', '46', 12345, '12345', 12345678, 'මීගස්තැන්න', 54),
('P.H අනිල් වසන්ත කුමාර', '47', 12345, '12345', 12345678, 'මීගස්තැන්න', 55),
('T.W.K ගයානි චන්ද්‍රිකා ', '48', 12345, '12345', 12345678, 'මුගුණුවින්න', 56),
('R.D දුෂාන්ති තිලිණි', '49', 12345, '12345', 12345678, 'මීගස්තැන්න', 57),
('G.ලසිකා කරුනාරත්න', '50', 12345, '12345', 12345678, 'මීගස්තැන්න', 58),
('H.L සෙනරත් චන්ද්‍රසේන ', '51', 12345, '12345', 12345678, 'ආදැල්ල', 59),
('G.A ඩිලාන් සම්පත් කුමාර', '52', 12345, '12345', 12345678, 'මීගස්තැන්න', 60),
('W.A ජානක දිස්න කුමාර', '53', 12345, '12345', 12345678, 'ගලබඩ', 61),
('W.A කපිල් ඉන්ද්‍රජිත් ', '54', 12345, '12345', 12345678, 'මීගස්තැන්න', 62),
('W.P ධර්මදාස ', '55', 12345, '12345', 12345678, 'පිල්ලෑව', 63),
('H.L චන්දිමා ලියනගේ ', '56', 12345, '12345', 12345678, 'ආදැල්ල', 64),
('A.A සංගීතා නලංගනී ප්‍රනාන්දු ', '57', 12345, '12345', 12345678, 'මීගස්තැන්න', 65),
('G.K සුමනදාස', '58', 12345, '12345', 12345678, 'මුගුණුවින්න', 66),
('පද්මසිරි ', '59', 12345, '12345', 12345678, 'මීගස්තැන්න', 67),
('W.A පුෂ්පා  රංජනී ', '60', 12345, '12345', 12345678, 'ගලබඩ', 68),
('දිනෙෂ් චන්ද්‍රසේන ', '38', 12345, '12345', 12345678, 'පිල්ලෑව', 138),
('abc', '4', 12345, '12345', 12345678, 'ගලබඩ', 1978);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `members`
--
ALTER TABLE `members`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1979;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
